Autodesk.Revit.DB.Opening.IsTransparentInElevation
Indicates if the opening is transparent in elevation view when loaded into the project.
Remarks: This property is only valid in Revit family documents.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when access this property in an opening belonging to a Revit project document.

Autodesk.Revit.DB.Opening.IsTransparentIn3D
Indicates if the opening is transparent in 3D view when loaded into the project.
Remarks: This property is only valid in Revit family documents.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when access this property in an opening belonging to a Revit project document.

Autodesk.Revit.DB.Opening.Host
Retrieves the host element of this opening.

Autodesk.Revit.DB.Opening.BoundaryCurves
The geometry information for non-rectangular openings in project documents,
or for all openings in family documents.
Remarks: If IsRectBoundary is true, this value is null.

Autodesk.Revit.DB.Opening.BoundaryRect
Retrieves the geometry information if the opening boundary is a rect.
Remarks: If IsRectBoundary is false, this value is null.

Autodesk.Revit.DB.Opening.IsRectBoundary
Retrieves the information whether the opening has a rectangular boundary.
Remarks: If the opening has a rectangular boundary, we can get the geometry information from BoundaryRect property.
Otherwise we should get the geometry information from BoundaryCurves property.

Autodesk.Revit.DB.Opening
An opening in an Autodesk Revit project or family document.
Remarks:
The object represents a variety of different types of openings:
A rectangular opening in a wall created by two boundary points in a revit project.An opening created by a set of curves applied to a roof, floor, ceiling, beam, brace or column.A vertical shaft opening extending one or more levels.A simple opening created on a wall or ceiling in a family document.
Depending upon the type of opening, some of the properties of this class will not be available.
Remarks: This object derived from the Element base object and such supports all the
methods of that object such as the ability to retrieve the parameters of that object. This
object also supports access to a structural analytical model but this feature is only
available with Autodesk Revit Structure.